{"data":{"program":{"category":{"name":"Cybersécurité"},"costsInter":[{"cost":3490.0}],"description":"Le Malware est un programme malicieux intentionnellement programmé pour endommager un équipement.\r\n\r\nL’intrusion de Malwares prend plusieurs formes allant du simple script à un code exécutable. Le Malware est connu au grand public sous plusieurs formes, notamment Virus, Trojan, Ransomware, Spyware, et Adware.\r\n\r\nL’intrusion de malwares dans le système d’informations d’une entreprise peut paralyser son activité, causer la fuite d’informations allant jusque causer la faillite de cette dernière. Il est donc important de connaître le fonctionnement de ces programmes malicieux afin de les identifier, les analyser et mettre en place les contremesures sécuritaires nécessaires.\r\n\r\nDans cette partie dite avancée de la formation Analyse de Malware, il s’agira de découvrir des techniques d’Analyse Dynamique de Malwares pour une meilleure compréhension de ces derniers. Ceci se fera sous environnement Windows et Android\r\n\r\nTout au long de la formation, des cas pratiques de démonstration et un laboratoire simulant une situation réelle dans le but d’assimiler efficacement les notions et concepts appris viendront agrémenter la formation.","durationInHours":35.0,"goals":[{"text":"Maîtriser l’analyse dynamique de Malwares"},{"text":"Démystifier la notion d’analyse via Sandbox"},{"text":"Comprendre les mécanismes d’un malware"},{"text":"Maîtriser l’Analyse de Malware Windows"},{"text":"Maîtriser l’Analyse de Malwares Android"}],"id":"399879","image":null,"name":"Analyse de Malware - Techniques avancées","steps":[{"substeps":[{"text":"Présentation de la formation"},{"text":"Se positionner par rapport à la première partie de la formation"}],"text":"Présentation de la formation"},{"substeps":[{"text":"Découvrir la méthodologie d’analyse dynamique de Malwares"},{"text":"Appréhender les vecteurs d’analyse dynamique"},{"text":"Analyser le chargement PE et la création de processus"},{"text":"Analyser les Dynamic-Link Library (DLL)"},{"text":"Découvrir le débogage de services"},{"text":"Travaux pratiques : maîtriser l’analyse dynamique : Étude de cas"}],"text":"Maîtriser l'analyse dynamique de Malwares"},{"substeps":[{"text":"Maîtriser la notion de Sandbox"},{"text":"Découvrir les architectures et le fonctionnement des Sandbox"},{"text":"Mettre en place une plateforme d’analyse automatisé : Cuckoo"},{"text":"Déployer une plateforme d’analyse automatisé : Cuckoo"},{"text":"Maitrisez l’analyse des résultats de Cuckoo"},{"text":"Découvrir les plateformes d’analyse hybride dans le cloud"},{"text":"Découvrir les mesures Anti-Analyse"},{"text":"Intégrer Cuckoo dans votre environnement de travail"}],"text":"Démystifier la notion d'analyse via Sandbox"},{"substeps":[{"text":"Comprendre les Malwares sous Linux"},{"text":"Rappel sur le format ELF"},{"text":"Découvrir l’analyse statique et dynamique sous Linux"},{"text":"Effectuer une analyse d’un malware sous Linux"},{"text":"Effectuer une analyse d’un malware IoT sur différentes architectures"}],"text":"Analyse de Malware Linux"},{"substeps":[{"text":"Découvrir l’analyse statique et dynamique sous Windows"},{"text":"Effectuer une analyse d’un malware sous Windows"},{"text":"Introduction à une plateforme tout-en-un d’analyse : FlareVM"}],"text":"Analyse de Malware Windows"},{"substeps":[{"text":"S’initier aux systèmes d’exploitation Android"},{"text":"Maitriser l’analyse de Malware avec MOBFS"},{"text":"Maîtriser l’analyse de la mémoire sous Android"}],"text":"Analyse de Malware sous Android"}]}}}