{"data":{"program":{"category":{"name":"Cybersécurité"},"costsInter":[{"cost":2180.0}],"description":"Le Malware est un programme malicieux intentionnellement programmé pour endommager un équipement. \r\n\r\nL’intrusion de Malwares prend plusieurs formes allant du simple script à un code exécutable. Le Malware est connu au grand public sous plusieurs formes, notamment Virus, Trojan, Ransomware, Spyware, et Adware.\r\n\r\nL’intrusion de malwares dans le système d’informations d’une entreprise peut paralyser son activité, causer la fuite d’informations allant jusque l’anéantissement de cette dernière. Il est donc important de connaître le fonctionnement de ces programmes malicieux afin de les identifier, les analyser et mettre en place les contremesures sécuritaires nécessaires.\r\n\r\nCette formation permettra d’obtenir une vision panoramique et globale de l’analyse de malwares et de pouvoir mettre en pratique des connaissances en situation réelle. \r\n\r\nLors de cette formation il s’agira de se familiariser avec le concept de Malware, explorer et comprendre les vecteurs et phases d’infection de Malwares, s’initier aux notions d’APTs et serveurs C&C. Sera également abordé la notion d’analyse statique de Malwares.\r\n\r\nTout au long de la formation, des cas pratiques de démonstration et un laboratoire simulant une situation réelle dans le but d’assimiler efficacement les notions et concepts appris viendront agrémenter la formation. Les pré-requis et fichiers nécessaires seront fournis en début de séance.","durationInHours":21.0,"goals":[{"text":"Découvrir la notion de Malware"},{"text":"Créer un environnement d’analyse de Malware avec les outils adaptés"},{"text":"Comprendre les mécanismes et les techniques utilisés par les Malwares"},{"text":"Connaître les différentes techniques d’Offuscation et de Packing de Malwares"},{"text":"Découvrir et maîtriser les techniques d’analyses statiques de Malwares"}],"id":"399856","image":{"url":"https://cdn.filestackcontent.com/sLRrgRULTaeyXoLCcqf5"},"name":"Analyse de Malware - Fondamentaux","steps":[{"substeps":[{"text":"Découvrir les malwares"},{"text":"Comprendre les vecteurs d’infection"},{"text":"Découvrir les phases d’infections des Malwares"},{"text":"Découvrir les APTs"},{"text":"Découvrir les serveurs C&C"},{"text":"Connaître la checklist"}],"text":"Introduction aux Malwares"},{"substeps":[{"text":"Appréhender les formats de fichiers"},{"text":"Appréhender le format ELF et PE"},{"text":"Découvrir les Tables IAT & EAT"},{"text":"Comprendre les API Windows"},{"text":"Découvrir la notion d’entropie"},{"text":"Découvrir les techniques de persistances"},{"text":"S’initier aux techniques d’offuscation"},{"text":"Découvrir le hooking IAT/EAT"},{"text":"Appréhender les techniques anti-analyses des Malwares"},{"text":"Structurer ses approches d’analyses"}],"text":"Techniques utilisées par les malwares & rappels"},{"substeps":[{"text":"Découvrir l’analyse statique"},{"text":"Identifier le type de fichier"},{"text":"Récupérer et identifier le Hash"},{"text":"Découvrir les techniques de scanning"},{"text":"Extraire les Strings"},{"text":"Détecter les techniques d’offuscation"},{"text":"Inspecter le Header PE"},{"text":"Classifier les Malwares"}],"text":"L'analyse statique"}]}}}