{"data":{"program":{"category":{"name":"Développement"},"costsInter":[{"cost":1.5e3}],"description":"Objectif de formation: Les participants apprendront les différents types de Bots, les technologies sous-jacentes, les plateformes de développement et les meilleures pratiques pour concevoir et déployer des Bots efficaces.","durationInHours":14.0,"goals":[{"text":"Comprendre les concepts clés des Bots et leur utilisation dans les entreprises"},{"text":"Maîtriser les technologies sous-jacentes utilisées pour développer des Bots"},{"text":"Connaître les différentes plateformes de développement de Bots et leurs fonctionnalités"},{"text":"Savoir concevoir et déployer des Bots efficaces sur différents canaux de communication"},{"text":"Anticiper les tendances futures des Bots et réfléchir à leur évolution"}],"id":"1354884","image":null,"name":"Bots : Panorama des Solutions Techniques","steps":[{"substeps":[{"text":"Définition et concepts clés des Bots"},{"text":"Les différents types de Bots : chatbots, voicebots, assistant virtuel, etc."},{"text":"Les bénéfices et les enjeux de l'utilisation des Bots dans les entreprises"}],"text":"Introduction aux Bots (2 heures)"},{"substeps":[{"text":"Les langages de programmation utilisés pour développer des Bots (ex. : Python, Node.js)"},{"text":"Les frameworks et les bibliothèques pour la création de Bots"},{"text":"Les API et les services cognitifs pour enrichir les fonctionnalités des Bots"},{"text":"Travaux pratiques : Développement d'un Bot simple à l'aide d'un framework"}],"text":"Technologies sous-jacentes (4 heures)"},{"substeps":[{"text":"Les différentes plateformes de développement de Bots (ex. : Microsoft Bot Framework, Dialogflow, IBM Watson)"},{"text":"Les fonctionnalités et les outils disponibles sur chaque plateforme"},{"text":"L'intégration avec d'autres services et applications"},{"text":"Travaux pratiques : Création d'un Bot sur une plateforme choisie"}],"text":"Plateformes de développement (4 heures)"},{"substeps":[{"text":"Les bonnes pratiques de conception de conversations pour les Bots"},{"text":"L'intégration des Bots dans les canaux de communication (ex. : site web, réseaux sociaux, messagerie)"},{"text":"Le déploiement et la gestion des Bots sur différentes plateformes"},{"text":"Travaux pratiques : Test et déploiement d'un Bot sur plusieurs canaux"}],"text":"Conception et Déploiement des Bots (3 heures)"},{"substeps":[{"text":"L'analyse des performances des Bots et l'optimisation des conversations"},{"text":"L'évolution des Bots avec l'intelligence artificielle et l'apprentissage automatique"},{"text":"Les tendances et les perspectives futures des Bots"},{"text":"Travaux pratiques : Réflexion sur l'amélioration et l'évolution d'un Bot existant"}],"text":"Optimisation et Évolution des Bots (1 heure)"}]}}}