{"data":{"program":{"category":{"name":"Design & Communication"},"costsInter":[{"cost":0.0}],"description":"Objectif de formation : Filmer, capturer, monter et finaliser des contenus visuels impactants","durationInHours":14.0,"goals":[{"text":"Acquérir une compréhension approfondie de l'outil de captation pour produire des vidéos de haute qualité."},{"text":"Réaliser des contenus visuels percutants en utilisant des techniques de tournage efficaces et créatives."},{"text":"Maîtriser les compétences de montage pour assembler les séquences de manière cohérente et captivante."},{"text":"Finaliser les contenus en appliquant des techniques de post-production pour obtenir des résultats professionnels."}],"id":"1345738","image":null,"name":"Capturer, Monter et Finaliser des Contenus Visuels Impactants","steps":[{"substeps":[{"text":"Compréhension des principes fondamentaux"},{"text":"Familiarisation avec l'outil de captation (caméra, smartphone, etc.) et ses fonctionnalités"},{"text":"TP : Exercices de manipulation de l'outil de captation pour se familiariser avec ses réglages et ses fonctionnalités"}],"text":"Introduction à l'outil de captation (1 heure)"},{"substeps":[{"text":"Composition visuelle : cadrage, angle, profondeur de champ"},{"text":"Utilisation de l'éclairage pour créer des ambiances visuelles"},{"text":"Captation du mouvement : stabilisation, travelling, panoramique"},{"text":"TP : Exercices pratiques de tournage en utilisant différentes techniques et situations de tournage"}],"text":"Techniques de tournage efficaces et créatives (4 heures)"},{"substeps":[{"text":"Présentation des principes de base du montage"},{"text":"Utilisation d'un logiciel de montage pour assembler les séquences"},{"text":"Techniques de transition, d'ajustement et de synchronisation des séquences"},{"text":"Travaux pratiques : Exercices de montage pour assembler les séquences tournées et créer une première version du contenu"}],"text":"Introduction au montage et à l'assemblage des séquences (3 heures)"},{"substeps":[{"text":"Utilisation de transitions créatives pour renforcer la narration visuelle"},{"text":"Application d'effets visuels et sonores pour améliorer l'impact du contenu"},{"text":"Utilisation de titres, de sous-titres et de superpositions graphiques"},{"text":"Travaux pratiques : Exercices pratiques de montage en utilisant des techniques avancées pour améliorer le contenu"}],"text":"Techniques avancées de montage (3 heures)"},{"substeps":[{"text":"Introduction aux techniques de post-production : correction des couleurs, ajustement du son, ajout de musique, etc."},{"text":"Exportation et optimisation des vidéos pour différents formats et plateformes"},{"text":"Travaux pratiques : Exercices de post-production pour finaliser le contenu et obtenir des résultats professionnels"}],"text":"Post-production et finalisation du contenu (3 heures)"}]}}}