{"data":{"program":{"category":{"name":"Big Data"},"costsInter":[{"cost":2.7e3}],"description":"Objectif de formation : Les formés apprendront à créer des applications d'intelligence artificielle qui utilisent : Azure Cognitive Services, Azure Cognitive Search et Microsoft Bot Framework\r\n\r\nExamen AI-102 pour la certification Microsoft Azure AI Engineer Associate","durationInHours":28.0,"goals":[{"text":"Créer, configurer, déployer et sécuriser Azure Cognitive Services"},{"text":"Décrire les considérations relatives au développement d'applications basées sur l'intelligence artificielle (AI)"},{"text":"Développer des applications qui analysent du texte"},{"text":"Développer des applications basées sur la parole"},{"text":"Créer des applications avec des capacités de compréhension du langage naturel"},{"text":"Créer des applications QnA"},{"text":"Créer des solutions conversationnelles avec des bots"},{"text":"Utiliser des services de vision par ordinateur pour analyser des images et des vidéos"},{"text":"Créer des modèles personnalisés de vision par ordinateur"},{"text":"Développer des applications qui détectent, analysent et reconnaissent les visages"},{"text":"Développer des applications qui lisent et traitent le texte dans les images et les documents"},{"text":"Créer des solutions de recherche intelligente pour l'exploration des connaissances"}],"id":"644372","image":{"url":"https://cdn.filestackcontent.com/CRZfd8hSSx6LIMANN3Oh"},"name":"Azure - Concevoir et mettre en oeuvre une solution d'IA","steps":[{"substeps":[{"text":"Introduction à l'intelligence artificielle (AI)"},{"text":"L'Intelligence artificielle dans Azure"},{"text":"Considérations relatives à la création d'applications basées sur l'intelligence artificielle (AI)"},{"text":"Identification des services Azure pour le développement d'applications basées sur l'intelligence artificielle (AI)"},{"text":"Travaux pratiques : créer une ressource de service cognitif Azure. \nSécuriser et conteneuriser les services cognitifs Azure"}],"text":"Introduction à l'intelligence artificielle sur Azure"},{"substeps":[{"text":"Démarrer avec des services cognitifs"},{"text":"Utiliser des services cognitifs pour les applications d'entreprise"},{"text":"Travaux pratiques : Prise en main. \nGérer la sécurité des services cognitifs. \nGérer la surveillance des services cognitifs. \nUtiliser un conteneur de services cognitifs."}],"text":"Développer des applications AI avec des services cognitifs"},{"substeps":[{"text":"Analyse du texte"},{"text":"Traduire un texte"}],"text":"S'initier au traitement du langage naturel"},{"substeps":[{"text":"Reconnaissance et synthèse de la parole"},{"text":"Traduction de la parole"}],"text":"Créer des applications vocales"},{"substeps":[{"text":"Création d'une application de compréhension de la langue"},{"text":"Publication et utilisation d'une application de compréhension du langage"},{"text":"Utilisation de la compréhension du langage avec la parole"}],"text":"Créer des solutions de compréhension du langage"},{"substeps":[{"text":"Créer une base de connaissances QnA"},{"text":"Publier et utiliser une base de connaissances QnA"}],"text":"Construire une solution QnA"},{"substeps":[{"text":"Les bases du bot"},{"text":"Mise en œuvre d'un robot conversationnel"},{"text":"Travaux pratiques : Créer un robot avec le Bot Framework SDK. \nCréer un bot avec Bot Framework Composer."}],"text":"AI conversationnelle et Azure Bot Service"},{"substeps":[{"text":"Analyser les images avec la vision par ordinateur"},{"text":"Analyser la vidéo avec Video Indexer"}],"text":"Débuter avec la vision par ordinateur"},{"substeps":[{"text":"Classifier les images avec Custom Vision"},{"text":"Détecter des objets dans des images avec Custom Vision"}],"text":"Développer des solutions de vision personnalisées"},{"substeps":[{"text":"Détection des visages avec le service de vision par ordinateur"},{"text":"Utilisation du service Visage"}],"text":"Détection, analyse et reconnaissance des visages"},{"substeps":[{"text":"Lecture de texte avec le service de vision par ordinateur"},{"text":"Extraction d'informations à partir de formulaires avec le service Reconnaissance de formulaires"},{"text":"Travaux pratiques : Lire le texte dans les images. \nExtraire des données des formulaires."}],"text":"Lire du texte dans des images et des documents"},{"substeps":[{"text":"Mise en œuvre d'une solution de recherche intelligente"},{"text":"Développement des compétences personnalisées pour un pipeline d'enrichissement"},{"text":"Création d'un magasin de connaissances"},{"text":"Travaux pratiques : Créer une solution Azure Cognitive Search. \nCréer une compétence personnalisée pour Azure Cognitive Search. \nCréer un magasin de connaissances avec Azure Cognitive Search."}],"text":"Solution d'extraction de connaissances"}]}}}