{"data":{"program":{"category":{"name":"Design & Communication"},"costsInter":[{"cost":1.0e3}],"description":"Objectif : Apprendre les fonctionnalités essentielles d'Adobe Captivate, ainsi que les bonnes pratiques de conception et de développement de modules e-learning.","durationInHours":14.0,"goals":[{"text":"Comprendre les fonctionnalités essentielles d'Adobe Captivate et son potentiel pour la création de contenus e-learning interactifs"},{"text":"Maîtriser les étapes clés de création d'un projet Captivate, de la conception à la publication"},{"text":"Savoir intégrer des médias et des ressources dans les modules e-learning"},{"text":"Acquérir les compétences nécessaires pour créer des scénarios interactifs et des quiz"}],"id":"1332316","image":null,"name":"Adobe Captivate","steps":[{"substeps":[{"text":"Présentation de l'interface d'Adobe Captivate et des fonctionnalités clés"},{"text":"Configuration des paramètres de projet"},{"text":"Travaux pratiques : Création d'un nouveau projet dans Adobe Captivate et exploration de l'interface."}],"text":"Introduction à Adobe Captivate (2 heures)"},{"substeps":[{"text":"Création de diapositives interactives et de scénarios"},{"text":"Utilisation des calques, des boutons et des états d'objet"},{"text":"Travaux pratiques : Création d'une série de diapositives interactives avec des scénarios."}],"text":"Création de diapositives et de scénarios (4 heures)"},{"substeps":[{"text":"Importation et gestion d'images, de vidéos et de sons"},{"text":"Utilisation des effets visuels et des transitions"},{"text":"Travaux pratiques : Ajout d'images, de vidéos et de sons à une présentation Captivate."}],"text":"Ajout de médias et de ressources (4 heures)"},{"substeps":[{"text":"Ajout d'interactivité à travers des questionnaires et des exercices"},{"text":"Utilisation des variables et des actions pour créer des scénarios interactifs"},{"text":"Travaux pratiques : Création d'un quiz interactif avec des questions à choix multiples et des exercices pratiques."}],"text":"Création d'interactivité et de quiz (4 heures)"}]}}}