{"data":{"program":{"category":{"name":"Développement"},"costsInter":[{"cost":2090.0}],"description":"Objectif: Apprendre les méthodologies, les outils et les bonnes pratiques pour analyser, concevoir et mettre en place des services répondant aux besoins des utilisateurs.","durationInHours":21.0,"goals":[{"text":"Comprendre les concepts et les principes de la transformation des besoins en services"},{"text":"Maîtriser les techniques d'analyse des besoins et d'identification des services"},{"text":"Être capable de concevoir des services répondant aux besoins des utilisateurs"},{"text":"Savoir planifier, mettre en place et évaluer des services dans un projet"},{"text":"Acquérir les compétences nécessaires pour accompagner la transformation des besoins en services en tant que chef de projet"}],"id":"1330990","image":null,"name":"Chef de projet : transformer les besoins en services","steps":[{"substeps":[{"text":"Compréhension des concepts clés liés à la transformation des besoins en services"},{"text":"Vue d'ensemble des méthodologies et des approches utilisées"},{"text":"Rôle du chef de projet dans ce processus"},{"text":"Travaux pratiques : Analyser un cas pratique de transformation des besoins en services en identifiant les besoins spécifiques, les parties prenantes impliquées et les exigences fonctionnelles et non fonctionnelles."}],"text":"Introduction à la transformation des besoins en services (2 heures)"},{"substeps":[{"text":"Techniques d'analyse des besoins des utilisateurs"},{"text":"Identification des services requis pour répondre aux besoins identifiés"},{"text":"Documentation des exigences et des caractéristiques des services"},{"text":"Travaux pratiques : Utiliser des techniques de collecte des besoins (entrevues, questionnaires, etc.) pour recueillir les informations nécessaires à partir d'un projet fictif."}],"text":"Analyse des besoins et identification des services (4 heures)"},{"substeps":[{"text":"Principes de conception des services orientés vers les besoins des utilisateurs"},{"text":"Modélisation des services à l'aide de diagrammes et de notations appropriées"},{"text":"Définition des interfaces et des contrats de service"},{"text":"Travaux pratiques : Définir les interfaces et les fonctionnalités des services, en tenant compte des dépendances et des interactions entre les services."}],"text":"Conception des services (6 heures)"},{"substeps":[{"text":"Planification et gestion du projet de mise en place des services"},{"text":"Sélection des technologies et des plateformes appropriées pour l'implémentation des services"},{"text":"Déploiement et intégration des services dans l'architecture existante"},{"text":"Travaux pratiques : Effectuer une simulation du déploiement en utilisant des scénarios réalistes pour évaluer les défis potentiels et proposer des solutions appropriées."}],"text":"Mise en place des services (6 heures)"},{"substeps":[{"text":"Méthodes de suivi et de mesure de la performance des services"},{"text":"Collecte et analyse des indicateurs de performance clés"},{"text":"Gestion des problèmes et des incidents liés aux services"},{"text":"Travaux pratiques : Suivre les services déployés dans le projet étudié en collectant les retours des utilisateurs et en analysant les performances des services."}],"text":"Suivi et évaluation des services (3 heures)"}]}}}