{"data":{"program":{"category":{"name":"Cybersécurité"},"costsInter":[{"cost":3490.0}],"description":"Objectif : Apprendre les techniques et les outils essentiels pour collecter, analyser et interpréter les données réseau, afin d'identifier les incidents de sécurité, les comportements anormaux et les failles de sécurité.","durationInHours":35.0,"goals":[{"text":"Comprendre les concepts et les méthodologies de l'analyse inforensique réseau"},{"text":"Maîtriser les techniques d'analyse de paquets et de détection d'anomalies"},{"text":"Savoir interpréter les données réseau pour identifier les incidents de sécurité"},{"text":"Acquérir les compétences nécessaires pour répondre aux incidents de sécurité réseau"}],"id":"1332573","image":null,"name":"Analyse inforensique réseau","steps":[{"substeps":[{"text":"Compréhension des principes de base de l'analyse inforensique réseau"},{"text":"Présentation des outils et des méthodologies couramment utilisés"},{"text":"Travaux pratiques : Installation et configuration des outils d'analyse inforensique réseau."}],"text":"Introduction à l'analyse inforensique réseau (3 heures)"},{"substeps":[{"text":"Utilisation d'outils de capture de paquets pour collecter les données réseau"},{"text":"Analyse des fichiers de capture de paquets"},{"text":"Extraction des métadonnées et des informations clés des paquets"},{"text":"Travaux pratiques : Capture et analyse de paquets réseau à l'aide d'outils tels que Wireshark."}],"text":"Collecte et capture de données réseau (8 heures)"},{"substeps":[{"text":"Étude approfondie des protocoles réseau courants tels que TCP/IP, DNS, HTTP, etc."},{"text":"Identification des anomalies et des comportements suspects dans les échanges de données"},{"text":"Analyse des journaux d'événements réseau"},{"text":"Travaux pratiques : Analyse de paquets réseau pour détecter des anomalies et des attaques."}],"text":"Analyse des protocoles réseau (10 heures)"},{"substeps":[{"text":"Utilisation d'outils de détection d'intrusion pour identifier les activités malveillantes"},{"text":"Analyse des journaux de sécurité et des alertes de sécurité"},{"text":"Mise en place de mesures de réponse aux incidents de sécurité réseau"},{"text":"Travaux pratiques : Détection et réponse à des incidents de sécurité réseau simulés."}],"text":"Détection et réponse aux incidents de sécurité réseau (8 heures)"},{"substeps":[{"text":"Création de rapports détaillés sur les incidents de sécurité identifiés"},{"text":"Présentation des résultats de l'analyse inforensique réseau"},{"text":"Communication des recommandations de sécurité"},{"text":"Travaux pratiques : Génération de rapports d'analyse inforensique réseau."}],"text":"Rapports et présentation des résultats (6 heures)"}]}}}